package classwork_05;

public class СравнениеЧисел {

//Что больше 15 или 37? Conditions (условия, сравнения)
// 15 < 37 - это ИСТИНА
    //25 - 17 = 8 > 0 => 25 > 17 это true
    //17 - 25 = -8 < 0 => 17 < 25 - это true
//    Как компьютер это понимает?
//    Сравнить числа A и B Алгоритм:
     //Шаг 1: A - B = С
    // Шаг 2: Если С > 0, то A > B - это TRUE(ИСТИНА), а если C < 0, то A > B - это FALSE (ЛОЖЬ)
//    Что больше -52 или -85?
    // -52 > - 85
//Что больше a или z (латинский алфавит)? Каждое число имеет код в числах, сравниваем эти числа (коды), a меньше, чем z, потому что ее код меньше, она раньше по таблице ASCII.
//AAAA > AAA1 А как мы это понимаем? - ... Как компьютер это понимает? - ...
//Условие (condition)
//символ > больше, x > y - логическое выражение
//символ < меньше, x < y
//это == равно, x == y.
//это >= больше или равно.
//это <= меньше или равно.
//ЛОЖЬ (false) или ПРАВДА (true) - это тип boolean;
//это != НЕ равно (<> - это в других языках) всё вышеперечисленное – это логические выражения.
//Логическое выражение принимает значение:


//УСЛОВНЫЙ ОПЕРАТОР
     //Оператор if( условие ) , условие - это логическое выражение
     //Условие в скобках оператора if ( ... ) - это логическое выражение, очень часто - это сравнение.
     //Условный оператор имеет полную форму, или сокращенную (без else).
     //Полная форма: if (условие){ команда_1; команда_2; ... } else { // иначе команда_1; команда_2; ... } ... сл. команда.
     //Сокращенная форма (без else): if (условие) { команда_1; команда_2; ... } ... сл. команда.

}
